sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_aesadv.h
                                                                                    boundary. An intermediate digest may
                                                                                    be requested during the
                                                                                    encryption/decryption data phase or
                                                                                    in the AAD phase. Note: Interruption
                                                                                    can only be done on full block (128
                                                                                    bits) boundaries. The minimum number
                                                                                    of remaining bytes to resume and
                                                                                    finalize the operation, must be
                                                                                    greater than or equal to 1. */
#define AESADV_CTRL_GET_DIGEST_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define AESADV_CTRL_GET_DIGEST_ENABLE            ((uint32_t)0x08000000U)         /* !< Enable */
/* AESADV_CTRL[GCM_CONT] Bits */
#define AESADV_CTRL_GCM_CONT_OFS                 (28)                            /* !< GCM_CONT Offset */
#define AESADV_CTRL_GCM_CONT_MASK                ((uint32_t)0x10000000U)         /* !< Continue processing of an
                                                                                    interrupted AES-GCM or AES-CCM
                                                                                    operation in the crypto/payload
                                                                                    phase. Set this write-only signal to
                                                                                    1b together with the regular mode bit
                                                                                    settings for a GCM or CCM operation,
                                                                                    to continue processing from the next
                                                                                    full block (128 bits) boundary.
                                                                                    Before setting this bit all
                                                                                    applicable context to resume
                                                                                    processing must have been loaded into
                                                                                    the engine: Keys, IV, intermediate
                                                                                    digest/TAG and block counter. The
                                                                                    mode can be written together with
                                                                                    this bit, as it is part of the same
                                                                                    register. */
#define AESADV_CTRL_GCM_CONT_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< No effect */
#define AESADV_CTRL_GCM_CONT_ENABLE              ((uint32_t)0x10000000U)         /* !< Enable */
/* AESADV_CTRL[SAVE_CNTXT] Bits */
#define AESADV_CTRL_SAVE_CNTXT_OFS               (29)                            /* !< SAVE_CNTXT Offset */
#define AESADV_CTRL_SAVE_CNTXT_MASK              ((uint32_t)0x20000000U)         /* !< This bit is used to indicate that
                                                                                    an authentication TAG or result IV
                                                                                    needs to be stored as a result
                                                                                    context. If this bit is set, context
                                                                                    output DMA and/or interrupt will be
                                                                                    asserted if the operation is
                                                                                    finished, and related signals are
                                                                                    enabled. Typically, this value must
                                                                                    be set for authentication modes
                                                                                    returning a TAG (CBC-MAC, GCM and
                                                                                    CCM), or for basic encryption modes
                                                                                    that require future continuation with
                                                                                    the current result IV. If this bit is
                                                                                    set, the engine will hold its full
                                                                                    context until the TAG and/or IV
                                                                                    registers are read. Only after
                                                                                    reading the TAG or IV, a new DMA
                                                                                    request for a new (input) context
                                                                                    will be asserted. If this bit is not
                                                                                    set, the engine will assert the
                                                                                    context input DMA request signal
                                                                                    directly after starting to process
                                                                                    the last block with the current
                                                                                    context. */
#define AESADV_CTRL_SAVE_CNTXT_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define AESADV_CTRL_SAVE_CNTXT_ENABLE            ((uint32_t)0x20000000U)         /* !< Enable */
/* AESADV_CTRL[SAVED_CNTXT_RDY] Bits */
#define AESADV_CTRL_SAVED_CNTXT_RDY_OFS          (30)                            /* !< SAVED_CNTXT_RDY Offset */
#define AESADV_CTRL_SAVED_CNTXT_RDY_MASK         ((uint32_t)0x40000000U)         /* !< If 1b, this read-only status bit
                                                                                    indicates that an AES authentication
                                                                                    TAG and/or IV block(s) is/are
                                                                                    available for the Host to retrieve.
                                                                                    This bit is only asserted if the
                                                                                    save_context bit is set to 1b. The
                                                                                    bit is mutually exclusive with the
                                                                                    context_ready bit. */
#define AESADV_CTRL_SAVED_CNTXT_RDY_NOTREADY     ((uint32_t)0x00000000U)         /* !< Not ready */
#define AESADV_CTRL_SAVED_CNTXT_RDY_READY        ((uint32_t)0x40000000U)         /* !< Ready */
/* AESADV_CTRL[CNTXT_RDY] Bits */
#define AESADV_CTRL_CNTXT_RDY_OFS                (31)                            /* !< CNTXT_RDY Offset */
#define AESADV_CTRL_CNTXT_RDY_MASK               ((uint32_t)0x80000000U)         /* !< If 1b, this read-only status bit
                                                                                    indicates that the context data
                                                                                    registers can be overwritten, and the
                                                                                    CPU is permitted to write the next
                                                                                    context. */
#define AESADV_CTRL_CNTXT_RDY_NOTREADY           ((uint32_t)0x00000000U)         /* !< Not ready */
#define AESADV_CTRL_CNTXT_RDY_READY              ((uint32_t)0x80000000U)         /* !< Ready */

/* AESADV_C_LENGTH_0 Bits */
/* AESADV_C_LENGTH_0[DATA] Bits */
#define AESADV_C_LENGTH_0_DATA_OFS               (0)                             /* !< DATA Offset */
#define AESADV_C_LENGTH_0_DATA_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< Bits [60:0] of the crypto length
                                                                                    registers (LSW and MSW) store the
                                                                                    cryptographic data length in bytes
                                                                                    for all modes. Once processing with
                                                                                    this context is started, this length
                                                                                    decrements to zero. Data lengths up
                                                                                    to (261-1) bytes are allowed. For
                                                                                    GCM, any value up to 236-32 bytes can
                                                                                    be used. This is because a 32-bit
                                                                                    counter mode is used; the maximum
                                                                                    number of 128-bit blocks is 232-2,
                                                                                    resulting in a maximum number of
                                                                                    bytes of 236-32. A write to this
                                                                                    register triggers the engine to start
                                                                                    using this context. This is valid for
                                                                                    all modes except GCM and CCM. Note
                                                                                    that for the combined modes, this
                                                                                    length does not include the
                                                                                    authentication only data; the
                                                                                    authentication length is specified in
                                                                                    the AES_AAD_LENGTH register below.
                                                                                    All modes must have a length > 0. For
                                                                                    the combined modes, it is allowed to
                                                                                    have one of the lengths equal to
                                                                                    zero. For the basic encryption modes
                                                                                    (ECB/CBC/CTR/ICM/CFB/OFB) it is
                                                                                    allowed to program zero to the length
                                                                                    field; in that case the length is
                                                                                    assumed infinite. All data must be
                                                                                    byte (8-bit) aligned for stream
                                                                                    cipher modes; bit aligned data
                                                                                    streams are not supported. For block
                                                                                    cipher modes, the data length must be
                                                                                    programmed in multiples of the block
                                                                                    cipher size, 16 bytes. */

