sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_aesadv.h
/* AESADV_DATA2 Bits */
/* AESADV_DATA2[DATA] Bits */
#define AESADV_DATA2_DATA_OFS                    (0)                             /* !< DATA Offset */
#define AESADV_DATA2_DATA_MASK                   ((uint32_t)0xFFFFFFFFU)         /* !< Data */

/* AESADV_DATA3 Bits */
/* AESADV_DATA3[DATA] Bits */
#define AESADV_DATA3_DATA_OFS                    (0)                             /* !< DATA Offset */
#define AESADV_DATA3_DATA_MASK                   ((uint32_t)0xFFFFFFFFU)         /* !< Data */

/* AESADV_TAG0 Bits */
/* AESADV_TAG0[DATA] Bits */
#define AESADV_TAG0_DATA_OFS                     (0)                             /* !< DATA Offset */
#define AESADV_TAG0_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< For a CPU read operation, these
                                                                                    registers contain the last 128-bit
                                                                                    TAG output of the engine; the TAG is
                                                                                    available until the next context is
                                                                                    written. This register will only
                                                                                    contain valid data if the TAG is
                                                                                    available, when the
                                                                                    saved_context_ready or get_digest bit
                                                                                    from AES_CTRL register is set. In
                                                                                    case of get_digest, the output will
                                                                                    be an intermediate TAG for CCM or GCM
                                                                                    operation continuation. During
                                                                                    processing or for operations/modes
                                                                                    that do not return a TAG, reads from
                                                                                    this register returns data from the
                                                                                    IV register. For operations that do
                                                                                    return a TAG in the IV register, the
                                                                                    IV register must be accessed
                                                                                    directly. */

/* AESADV_TAG1 Bits */
/* AESADV_TAG1[DATA] Bits */
#define AESADV_TAG1_DATA_OFS                     (0)                             /* !< DATA Offset */
#define AESADV_TAG1_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< For a CPU read operation, these
                                                                                    registers contain the last 128-bit
                                                                                    TAG output of the engine; the TAG is
                                                                                    available until the next context is
                                                                                    written. This register will only
                                                                                    contain valid data if the TAG is
                                                                                    available, when the
                                                                                    saved_context_ready or get_digest bit
                                                                                    from AES_CTRL register is set. In
                                                                                    case of get_digest, the output will
                                                                                    be an intermediate TAG for CCM or GCM
                                                                                    operation continuation. During
                                                                                    processing or for operations/modes
                                                                                    that do not return a TAG, reads from
                                                                                    this register returns data from the
                                                                                    IV register. For operations that do
                                                                                    return a TAG in the IV register, the
                                                                                    IV register must be accessed
                                                                                    directly. */

/* AESADV_TAG2 Bits */
/* AESADV_TAG2[DATA] Bits */
#define AESADV_TAG2_DATA_OFS                     (0)                             /* !< DATA Offset */
#define AESADV_TAG2_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< For a CPU read operation, these
                                                                                    registers contain the last 128-bit
                                                                                    TAG output of the engine; the TAG is
                                                                                    available until the next context is
                                                                                    written. This register will only
                                                                                    contain valid data if the TAG is
                                                                                    available, when the
                                                                                    saved_context_ready or get_digest bit
                                                                                    from AES_CTRL register is set. In
                                                                                    case of get_digest, the output will
                                                                                    be an intermediate TAG for CCM or GCM
                                                                                    operation continuation. During
                                                                                    processing or for operations/modes
                                                                                    that do not return a TAG, reads from
                                                                                    this register returns data from the
                                                                                    IV register. For operations that do
                                                                                    return a TAG in the IV register, the
                                                                                    IV register must be accessed
                                                                                    directly. */

/* AESADV_TAG3 Bits */
/* AESADV_TAG3[DATA] Bits */
#define AESADV_TAG3_DATA_OFS                     (0)                             /* !< DATA Offset */
#define AESADV_TAG3_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< For a CPU read operation, these
                                                                                    registers contain the last 128-bit
                                                                                    TAG output of the engine; the TAG is
                                                                                    available until the next context is
                                                                                    written. This register will only
                                                                                    contain valid data if the TAG is
                                                                                    available, when the
                                                                                    saved_context_ready or get_digest bit
                                                                                    from AES_CTRL register is set. In
                                                                                    case of get_digest, the output will
                                                                                    be an intermediate TAG for CCM or GCM
                                                                                    operation continuation. During
                                                                                    processing or for operations/modes
                                                                                    that do not return a TAG, reads from
                                                                                    this register returns data from the
                                                                                    IV register. For operations that do
                                                                                    return a TAG in the IV register, the
                                                                                    IV register must be accessed
                                                                                    directly. */

